Documents/ЗаявкаНаПодборПерсонала.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЗаявкаНаПодборПерсонала</Name>
			<BasedOn>
				<xr:Item>Catalog.ПрофилиДолжностей</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Позиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрофильДолжности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрофилиДолжностей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоответствуетПрофилюДолжности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Требования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обязанности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Условия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредполагаемыйДоход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланируемаяДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Приоритет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОткрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОткрытияВакансий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСостояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСогласования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРассмотрел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДатаРассмотрения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособНабора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособНабораПерсоналаНаВакансию</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеНабора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НазначениеНабораПерсоналаНаВакансию</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоваяПозиция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеобходимоЧеловек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗарплатаОт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗарплатаДо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаЗарплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьЗарплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьОжидаемогоДоходаКандидатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйСобеседование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспытательныйСрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗанятости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗанятости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимРаботы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ХарактеристикиПерсонала</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗначенияХарактеристик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетсяПроверка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетсяОбучение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесЗначения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьЗначение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ХарактеристикиПерсонала</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДействияСотрудников</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДействиеСотрудника</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДействияСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/НазначениеНабораПерсоналаНаВакансию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>НазначениеНабораПерсоналаНаВакансию</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПозицияШтатногоРасписания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДолжностьПодразделение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособНабораПерсоналаНаВакансию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособНабораПерсоналаНаВакансию</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МассовыйНабор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕдиничныйНабор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПериодичностьОжидаемогоДоходаКандидатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ПериодичностьОжидаемогоДоходаКандидатов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Час</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПричиныОткрытияВакансий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПричиныОткрытияВакансий</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ЗаявкаНаПодборПерсонала/Forms/МастерСозданияЗаявки/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьПодразделениеПользователя();
	
	Объект.НазначениеНабора = Перечисления.НазначениеНабораПерсоналаНаВакансию.ПозицияШтатногоРасписания;
	Объект.СпособНабора = Перечисления.СпособНабораПерсоналаНаВакансию.ЕдиничныйНабор;
	Объект.НеобходимоЧеловек = 1;
	Объект.ВалютаЗарплаты = ЗарплатаКадры.ВалютаУчетаЗаработнойПлаты();
	Объект.ПериодичностьЗарплаты = Перечисления.ПериодичностьОжидаемогоДоходаКандидатов.Месяц;
	ТекущаяСтраница = 1;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы 

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	ПодразделениеОрганизации = ПодразделениеОрганизации(Объект.Подразделение);
	Объект.Позиция = Неопределено;
	Объект.Должность = Неопределено;
	ЗаполнитьДанныеПоПозиции();
	
КонецПроцедуры

&НаКлиенте
Процедура ПозицияПриИзменении(Элемент)
	
	ЗаполнитьДанныеПоПозиции();
	УстановитьДоступностьПодразделения();
	
КонецПроцедуры

&НаКлиенте
Процедура ДолжностьПриИзменении(Элемент)
	
	ЗаполнитьДанныеПоДолжности();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрофильДолжностиПриИзменении(Элемент)
	
	ЗаполнитьДанныеПоПрофилюДолжности();
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантыПозицииПриИзменении(Элемент)
	
	УстановитьДоступностьПозицииДолжности();
	ЗаполнитьПричинуОткрытия();
	УстановитьДоступностьПодразделения();
	
КонецПроцедуры

&НаКлиенте
Процедура НеобходимоЧеловекПриИзменении(Элемент)
	
	УстановитьЗаголовкиНеобходимоЧеловек(ЭтотОбъект);
	Если Объект.НазначениеНабора = ПредопределенноеЗначение(
		"Перечисление.НазначениеНабораПерсоналаНаВакансию.ПозицияШтатногоРасписания")
		И СвободноСтавок <> 0 Тогда
		Если Объект.НеобходимоЧеловек > СвободноСтавок Тогда
			ВидимостьПредупреждения = Истина;
		Иначе
			ВидимостьПредупреждения = Ложь;
		КонецЕсли;
		УстановитьВидимостьПредупрежденияЗанятостьПозиций(Элементы, ВидимостьПредупреждения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспытательныйСрокПриИзменении(Элемент)
	УстановитьСклонениеИспытательногоСрока(Объект.ИспытательныйСрок, Элемент);
	УстановитьВидимостьПредупреждения(Объект.ИспытательныйСрок, Элементы.ИспытательныйСрокПредупреждение);
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаОтПриИзменении(Элемент)
	Элементы.ЗарплатаДо.МинимальноеЗначение = Объект.ЗарплатаОт;
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаДоПриИзменении(Элемент)
	Элементы.ЗарплатаОт.МаксимальноеЗначение = Объект.ЗарплатаДо;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Далее(Команда)
	
	Если ТекущаяСтраница = 1 Тогда
		ТекущаяСтраница = 2;
		Элементы.Далее.Видимость = Истина;
		Элементы.Назад.Видимость = Истина;
		Элементы.Готово.Видимость = Ложь;
		Элементы.СтраницыНоваяЗаявка.ТекущаяСтраница = Элементы.СтраницаОбязанностиТребования;
	ИначеЕсли ТекущаяСтраница = 2 Тогда
		ТекущаяСтраница = 3;
		Элементы.Далее.Видимость = Ложь;
		Элементы.Назад.Видимость = Истина;
		Элементы.Готово.Видимость = Истина;
		Элементы.СтраницыНоваяЗаявка.ТекущаяСтраница = Элементы.СтраницаУсловия;
	Иначе
		ТекущаяСтраница = 1;
		Элементы.Далее.Видимость = Истина;
		Элементы.Назад.Видимость = Ложь;
		Элементы.Готово.Видимость = Ложь;
		Элементы.СтраницыНоваяЗаявка.ТекущаяСтраница = Элементы.СтраницаПозиция;
	КонецЕсли;
	Элементы.ДекорацияСтраницы.Заголовок = СтрШаблон(НСтр("ru = '%1 из 3'"), ТекущаяСтраница);
	
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	
	Если ТекущаяСтраница = 3 Тогда
		ТекущаяСтраница = 2;
		Элементы.Далее.Видимость = Истина;
		Элементы.Назад.Видимость = Истина;
		Элементы.Готово.Видимость = Ложь;
		Элементы.СтраницыНоваяЗаявка.ТекущаяСтраница = Элементы.СтраницаОбязанностиТребования;
	ИначеЕсли ТекущаяСтраница = 2 Тогда
		ТекущаяСтраница = 1;
		Элементы.Далее.Видимость = Истина;
		Элементы.Назад.Видимость = Ложь;
		Элементы.Готово.Видимость = Ложь;
		Элементы.СтраницыНоваяЗаявка.ТекущаяСтраница = Элементы.СтраницаПозиция;
	Иначе
		ТекущаяСтраница = 3;
		Элементы.Далее.Видимость = Ложь;
		Элементы.Назад.Видимость = Истина;
		Элементы.Готово.Видимость = Истина;
		Элементы.СтраницыНоваяЗаявка.ТекущаяСтраница = Элементы.СтраницаУсловия;
	КонецЕсли;
	Элементы.ДекорацияСтраницы.Заголовок = СтрШаблон(НСтр("ru = '%1 из 3'"), ТекущаяСтраница);
	
КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)
	
	СоздатьЗаявкуНачало();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаявкуНачало()
	
	ПустыеПоля = Новый Массив;
	Если Не ЗначениеЗаполнено(Объект.Обязанности) Тогда
		ПустыеПоля.Добавить(НСтр("ru = 'Обязанности'"));
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Требования) Тогда
		ПустыеПоля.Добавить(НСтр("ru = 'Требования'"));
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Условия) Тогда
		ПустыеПоля.Добавить(НСтр("ru = 'Условия'"));
	КонецЕсли;
	
	Если ПустыеПоля.Количество() = 0 Тогда
		ОткрытьЗаявку();
		Возврат;
	КонецЕсли;
	
	ОбработчикОтвета = Новый ОписаниеОповещения("СоздатьЗаявкуЗавершение", ЭтотОбъект);
	
	ПараметрыВопроса = СтандартныеПодсистемыКлиент.ПараметрыВопросаПользователю();
	ПараметрыВопроса.Заголовок = НСтр("ru = 'Создание заявки'");
	ПараметрыВопроса.Картинка = БиблиотекаКартинок.Предупреждение32;
	ПараметрыВопроса.ПредлагатьБольшеНеЗадаватьЭтотВопрос = Ложь;
	
	ТекстВопроса = СтрШаблон(НСтр("ru = '%1 не заполнены. Продолжить создание заявки?'"),
		СтрСоединить(ПустыеПоля, ", "));
	
	СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(
		ОбработчикОтвета, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена, ПараметрыВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаявкуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Или Результат.Значение <> КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьЗаявку();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗаявку()
	
	ОткрытьФорму("Документ.ЗаявкаНаПодборПерсонала.ФормаОбъекта", Новый Структура("Основание", Объект));
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПодразделениеПользователя()
	
	ФизическоеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователи.ТекущийПользователь(), "ФизическоеЛицо");
	Если Не ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		Возврат;
	КонецЕсли;
	
	Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	Период = ОбщегоНазначения.ТекущаяДатаПользователя();
	Сотрудник = КадровыйУчет.ОсновнойСотрудникФизическогоЛица(ФизическоеЛицо, Организация, Период);
	
	УстановитьПривилегированныйРежим(Истина);
	КадровыеДанныеСотрудника = КадровыйУчет.КадровыеДанныеСотрудника(Истина, Сотрудник, "Подразделение", Период);
	УстановитьПривилегированныйРежим(Ложь);
	Если Не ЗначениеЗаполнено(КадровыеДанныеСотрудника) Тогда
		Возврат;
	КонецЕсли;
	
	Подразделение = КадровыеДанныеСотрудника.Подразделение;
	Если Не ЗначениеЗаполнено(Подразделение) Тогда
		Возврат;
	КонецЕсли;
	
	ПодразделениеОрганизации = Подразделение;
	Объект.Подразделение = ОрганизационнаяСтруктура.ПодразделениеВСтруктуреПредприятия(ПодразделениеОрганизации);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьПозицииДолжности()
	
	Если Объект.НазначениеНабора =
		Перечисления.НазначениеНабораПерсоналаНаВакансию.ДолжностьПодразделение Тогда
		Объект.НоваяПозиция = Истина;
		УстановитьВидимостьПредупрежденияЗанятостьПозиций(Элементы, Ложь);
	Иначе
		Объект.НоваяПозиция = Ложь;
		ЗаполнитьДанныеПоПозиции();
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "Позиция", "Доступность", Не Объект.НоваяПозиция);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "Должность", "Доступность", Объект.НоваяПозиция);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьПодразделения()
	
	Если Не ЗначениеЗаполнено(Объект.Позиция) Или Объект.НазначениеНабора =
		Перечисления.НазначениеНабораПерсоналаНаВакансию.ДолжностьПодразделение Тогда
		ТолькоПросмотрПодразделения = Ложь;
	Иначе
		ТолькоПросмотрПодразделения = Истина;
	КонецЕсли;
	
	ЗаполнитьПодразделение();
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "Подразделение", "ТолькоПросмотр", ТолькоПросмотрПодразделения);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодразделение()
	
	ДанныеПозиции = Справочники.ШтатноеРасписание.ДанныеПозицииШтатногоРасписания(Объект.Позиция);
	
	Если ЗначениеЗаполнено(ДанныеПозиции.МестоВСтруктуреПредприятия) Тогда
		Объект.Подразделение = ДанныеПозиции.МестоВСтруктуреПредприятия;
	КонецЕсли;
	
	ПодразделениеОрганизации = ПодразделениеОрганизации(Объект.Подразделение);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПоПозиции()
	
	ДанныеПозиции = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Позиция, "Должность,КоличествоСтавок");
	Объект.Должность = ДанныеПозиции.Должность;
	ПрофилиДолжностей = ХарактеристикиПерсонала.ПрофильДолжностиПоПозицииШтатногоРасписания(Объект.Позиция);
	Если ПрофилиДолжностей.Количество() > 0 Тогда
		Объект.ПрофильДолжности = ПрофилиДолжностей[0];
	Иначе
		Объект.ПрофильДолжности = Неопределено;
	КонецЕсли;
	ЗаполнитьДанныеПоПрофилюДолжности();
	
	ВидимостьПредупреждения = Ложь;
	Если Не ЗначениеЗаполнено(Объект.Позиция) Тогда
		УстановитьВидимостьПредупрежденияЗанятостьПозиций(Элементы, ВидимостьПредупреждения);
		Возврат;
	КонецЕсли;
	
	Позиции = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Позиция);
	СвободныеПозицииШтатногоРасписания = УправлениеШтатнымРасписанием.СвободныеПозицииШтатногоРасписания(Позиции);
	Если СвободныеПозицииШтатногоРасписания = Неопределено Тогда
		УстановитьВидимостьПредупрежденияЗанятостьПозиций(Элементы, ВидимостьПредупреждения);
		Возврат;
	КонецЕсли;
	
	СвободноСтавокПоПричине = СвободныеПозицииШтатногоРасписания.Получить(Объект.Позиция);
	Если СвободноСтавокПоПричине <> Неопределено Тогда
		СвободноСтавок = СвободноСтавокПоПричине.СвободноСтавок;
		Объект.НеобходимоЧеловек = СвободноСтавок;
		Объект.ПричинаОткрытия = ПричинаОткрытия(СвободноСтавокПоПричине.Причина);
	Иначе
		Объект.НеобходимоЧеловек = 1;
		ВидимостьПредупреждения = Истина;
	КонецЕсли;
	УстановитьВидимостьПредупрежденияЗанятостьПозиций(Элементы, ВидимостьПредупреждения);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПоДолжности()
	
	ПрофилиПоКадровойДолжности = Справочники.ПрофилиДолжностей.ПрофилиПоКадровойДолжности(Объект.Должность);
	Если ПрофилиПоКадровойДолжности.Количество() = 1 Тогда
		Объект.ПрофильДолжности = ПрофилиПоКадровойДолжности[0];
		ЗаполнитьДанныеПоПрофилюДолжности();
	Иначе
		Объект.ПрофильДолжности = Неопределено;
		Объект.Требования = Неопределено;
		Объект.Обязанности = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПоПрофилюДолжности()
	
	Если Не ЗначениеЗаполнено(Объект.ПрофильДолжности) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПолучения = Справочники.ПрофилиДолжностей.ПараметрыПолученияДанныхПрофиляДолжности();
	ПараметрыПолучения.ЭтапыРаботыСКандидатами = Ложь;
	
	ДанныеПрофиля = Справочники.ПрофилиДолжностей.ДанныеПрофиляДолжности(Объект.ПрофильДолжности, ПараметрыПолучения);
	
	Если ДанныеПрофиля.Свойство("ХарактеристикиПерсонала") Тогда
		Объект.ХарактеристикиПерсонала.Очистить();
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДанныеПрофиля.ХарактеристикиПерсонала, Объект.ХарактеристикиПерсонала);
	КонецЕсли;
	
	Если ДанныеПрофиля.Свойство("ДействияСотрудников") Тогда
		Объект.ДействияСотрудников.Очистить();
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДанныеПрофиля.ДействияСотрудников, Объект.ДействияСотрудников);
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Объект, ДанныеПрофиля,
		"Требования,
		|Обязанности,
		|Условия,
		|ИспытательныйСрок,
		|ЗарплатаОт,
		|ЗарплатаДо,
		|ВалютаЗарплаты,
		|ПериодичностьЗарплаты,
		|ТипЗанятости,
		|РежимРаботы");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПричинуОткрытия()
	
	Если Объект.НазначениеНабора =
		Перечисления.НазначениеНабораПерсоналаНаВакансию.ДолжностьПодразделение Тогда
		Объект.ПричинаОткрытия = Справочники.ПричиныОткрытияВакансий.НайтиПоНаименованию("Новая позиция", Истина);
	Иначе
		Объект.ПричинаОткрытия = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПодразделениеОрганизации(Подразделение)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Подразделение, "Источник")
	
КонецФункции

&НаСервереБезКонтекста
Функция ПричинаОткрытия(Основание)
	
	ТипЗнчОснования = ТипЗнч(Основание);
	Если ТипЗнчОснования = Тип("ДокументСсылка.Увольнение")
		Или ТипЗнчОснования = Тип("ДокументСсылка.УвольнениеСписком") Тогда
		ПричинаОткрытия = Справочники.ПричиныОткрытияВакансий.НайтиПоНаименованию("Увольнение", Истина);
	ИначеЕсли ТипЗнчОснования = Тип("ДокументСсылка.ОтпускПоУходуЗаРебенком") Тогда
		ПричинаОткрытия = Справочники.ПричиныОткрытияВакансий.НайтиПоНаименованию("Отпуск по уходу за ребенком", Истина);
	ИначеЕсли ТипЗнчОснования = Тип("ДокументСсылка.КадровыйПеревод")
		Или ТипЗнчОснования = Тип("ДокументСсылка.КадровыйПереводСписком") Тогда
		ПричинаОткрытия = Справочники.ПричиныОткрытияВакансий.НайтиПоНаименованию("Внутренний перевод", Истина);
	Иначе
		ПричинаОткрытия = Неопределено;
	КонецЕсли;
	
	Возврат ПричинаОткрытия;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовкиНеобходимоЧеловек(Форма)
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Элементы.НеобходимоЧеловек.Заголовок = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
		НСтр("ru = ';Необходим;;Необходимо;Необходимо;'"), Объект.НеобходимоЧеловек);
	
	Элементы.НеобходимоЧеловек.Подсказка = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
		НСтр("ru = ';человек;;человека;человек;'"), Объект.НеобходимоЧеловек);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьПредупрежденияЗанятостьПозиций(Элементы, ВидимостьПредупреждения)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ГруппаПредупреждениеЗанятостьПозиций", "Видимость", ВидимостьПредупреждения);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСклонениеИспытательногоСрока(ИспытательныйСрок, Элемент)
	Элемент.Подсказка = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
		НСтр("ru = ';месяц;;месяца;месяцев;'"), ИспытательныйСрок);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьПредупреждения(ИспытательныйСрок, Предупреждение)
	Предупреждение.Видимость = (ИспытательныйСрок > 3);
КонецПроцедуры

#КонецОбласти
